---
title: "Git"
date: 2021-09-17T14:20:01+04:30
tags: ['git', 'VCS', ]
draft: true
---
!["git"](/images/Git/git.png)

## دستورات گیت
1-وارد کردن گیت در پروژه
```
$ git init
```
2- اضافه کردن تغییرات یک فایل و بردن به استیج
```
$ git add {اسم فایل}
```
  2.1- اضافه کردن تغییرات تمامی فایل های پروژه
  ```
  $ git add -A
  ```
3- کامیت کردن تغییرات:
```
$ git commit
```
3.1-کامیت کردن تغییرات به همراه کامیت مسیج
```
$ git commit -m {متن پیام}
```
4- مشاهده برنچ های موجود در پروژه:
```
$ git branch
```
5-ساخت برنچ جدید در پروژه یا رفتن به یکی از یرنچ های پروژه
```
$ git branch {نام دلخواه برای برنچ}
```
6-مرج کردن یک برنچ
```
$ git merge {اسم برنچ}
```
7- حذف کردن یک برنچ
```
$ git branch -d {اسم برنچ}
```
7.1- حذف یک برنچ مرج نشده
```
$ git branch -D {اسم برنچ}
```

Author or Authors: Shahriar Ghasempour

- Email: <shahriaarrr@gmail.com>
